{
    "rooms": {
        "playroom": {
            "description": "Well, here we are in the playroom. Okay, just remember what you're here to do, and everything will go great.\n\n You can make out [if c_0 is locked]a locked[else if c_0 is open]an opened[otherwise]a closed[end if] locker nearby.[if c_0 is open and there is something in the c_0] The locker contains [a list of things in the c_0].[end if][if c_0 is open and the c_0 contains nothing] The locker is empty! What a waste of a day![end if]\n\n There is [if d_1 is open]an open[otherwise]a closed[end if] gate leading west. You need an unblocked exit? You should try going east.",
            "exits": {},
            "items": []
        },
        "bedroom": {
            "description": "You're now in a bedroom.\n\n [if c_1 is locked]A locked[else if c_1 is open]An open[otherwise]A closed[end if] normal looking trunk is here.[if c_1 is open and there is something in the c_1] The trunk contains [a list of things in the c_1]. Classic TextWorld.[end if][if c_1 is open and the c_1 contains nothing] The trunk is empty, what a horrible day![end if] You can make out a safe. You check the price tag that's still affixed to the safe. 25 bucks? What a deal! You'll have to ask where they got this![if c_2 is open and there is something in the c_2] The safe contains [a list of things in the c_2]. You idly wonder how they came up with the name TextWorld for this place. It's pretty fitting.[end if][if c_2 is open and the c_2 contains nothing] The safe is empty! This is the worst thing that could possibly happen, ever![end if]\n\n There is [if d_1 is open]an open[otherwise]a closed[end if] gate leading east. You need an unblocked exit? You should try going north. There is an unguarded exit to the west.",
            "exits": {},
            "items": []
        },
        "cookery": {
            "description": "Well, here we are in a cookery.\n\n Were you looking for a rack? Because look over there, it's a rack. [if there is something on the s_0]On the rack you can make out [a list of things on the s_0].[end if][if there is nothing on the s_0]But the thing is empty, unfortunately.[end if] Were you looking for a plate? Because look over there, it's a plate. [if there is something on the s_1]You see [a list of things on the s_1] on the plate. I mean, just wow! Isn't TextWorld just the best?[end if][if there is nothing on the s_1]Unfortunately, there isn't a thing on it. Oh! Why couldn't there just be stuff on it?[end if]\n\nThere is an unguarded exit to the east. There is an unguarded exit to the north.",
            "exits": {},
            "items": []
        },
        "pantry": {
            "description": "You arrive in a pantry.\n\n Look over there! a chest. Hmmm... what else, what else?[if c_3 is open and there is something in the c_3] The chest contains [a list of things in the c_3].[end if][if c_3 is open and the c_3 contains nothing] The chest is empty! What a waste of a day![end if] You rest your hand against a wall, but you miss the wall and fall onto a case.[if c_4 is open and there is something in the c_4] The case contains [a list of things in the c_4].[end if][if c_4 is open and the c_4 contains nothing] Empty! What kind of nightmare TextWorld is this?[end if]\n\nThere is an unblocked exit to the south. You don't like doors? Why not try going west, that entranceway is unblocked.",
            "exits": {},
            "items": []
        },
        "study": {
            "description": "You've just sauntered into a study.\n\n You can make out a shelf. [if there is something on the s_2]On the shelf you see [a list of things on the s_2]. Suddenly, you bump your head on the ceiling, but it's not such a bad bump that it's going to prevent you from looking at objects and even things.[end if][if there is nothing on the s_2]But the thing is empty. It would have been so cool if there was stuff on the shelf.[end if]\n\n There is [if d_0 is open]an open[otherwise]a closed[end if] hatch leading north. You don't like doors? Why not try going east, that entranceway is unguarded. There is an exit to the south. Don't worry, it is unblocked.",
            "exits": {},
            "items": []
        },
        "basement": {
            "description": "You arrive in a basement. An usual one. You begin to take stock of what's in the room.\n\n You make out a toolbox. You shudder, but continue examining the room.[if c_5 is open and there is something in the c_5] The toolbox contains [a list of things in the c_5].[end if][if c_5 is open and the c_5 contains nothing] The toolbox is empty! This is the worst thing that could possibly happen, ever![end if]\n\nThere is an exit to the south. Don't worry, it is unguarded. You don't like doors? Why not try going west, that entranceway is unblocked.",
            "exits": {},
            "items": []
        },
        "chamber": {
            "description": "You are in a chamber. A standard kind of place. You can barely contain your excitement.\n\n\n\nYou need an unblocked exit? You should try going east. There is an exit to the south. Don't worry, it is unguarded.",
            "exits": {},
            "items": []
        },
        "kitchen": {
            "description": "You are in a kitchen. A typical one.\n\n\n\nYou don't like doors? Why not try going north, that entranceway is unblocked. You don't like doors? Why not try going west, that entranceway is unblocked.",
            "exits": {},
            "items": []
        },
        "parlor": {
            "description": "You find yourself in a parlor. A normal kind of place.\n\n You can make out a bench. The bench is typical.[if there is something on the s_3] On the bench you can see [a list of things on the s_3].[end if][if there is nothing on the s_3] Unfortunately, there isn't a thing on it.[end if]\n\n There is [if d_0 is open]an open[otherwise]a closed[end if] hatch leading south. You need an unblocked exit? You should try going east. You need an unguarded exit? You should try going north.",
            "exits": {},
            "items": []
        },
        "spare room": {
            "description": "You've entered a spare room. The room seems oddly familiar, as though it were only superficially different from the other rooms in the building.\n\n\n\nThere is an exit to the west. Don't worry, it is unblocked.",
            "exits": {},
            "items": []
        }
    },
    "player_start": "unknown"
}